Revit 2024 API
SpecTypeId.Displacement Property
 Displacement/Deflection, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId Displacement { get; }
Visual Basic
Public Shared ReadOnly Property Displacement As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Displacement {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace